20211217165855-web_api.org
:PROPERTIES:
:ID:       c7052a0d-0714-409a-86a7-4d4770240ada
:END:
#+title: Web API
* 概要
幅広いAPIという概念のなかで、とくにWebのこと、Web APIについてまとめる。
[[id:e04aa1a3-509c-45b2-ac64-53d69c961214][Rails]]などWEBアプリケーションを開発する場合、必ず使う。
* Memo
** Swagger
SwaggerはAPIドキュメントツールである。ymlやjsonを記述して、ブラウザで閲覧できる。
[[id:e04aa1a3-509c-45b2-ac64-53d69c961214][Rails]]でのラッパーライブラリはrswagで、自然に扱うことができる。

- リポジトリ
  [[https://github.com/rswag/rswag][rswag/rswag: Seamlessly adds a Swagger to Rails-based API's]]
- コードの例
  [[https://github.com/ruslantolstov/rswag-example][ruslantolstov/rswag-example: Demo how to use rswag-api, rswag-specs.]]
- 記法例
  [[https://techblog.zozo.com/entry/swagger_yaml][開発効率を上げる！Swaggerの記法まとめ - ZOZO TECH BLOG]]

まとまっているサイト。[[https://qiita.com/disc99/items/37228f5d687ad2969aa2][SwaggerでRESTful APIの管理を楽にする - Qiita]]

* Tasks
** TODO API周りのソースコードを見る
- だいたいの型
- 実装の流れ
** TODO [[https://www.amazon.co.jp/Web-API-Parts-%E6%B0%B4%E9%87%8E-%E8%B2%B4%E6%98%8E/dp/4873116864/ref=sr_1_2?__mk_ja_JP=%E3%82%AB%E3%82%BF%E3%82%AB%E3%83%8A&crid=176CX1TFR474&keywords=web+api&qid=1640733660&sprefix=web%2Caps%2C1017&sr=8-2][Web API: The Good Parts | 水野 貴明 |本 | 通販 | Amazon]]
** TODO [[https://railsguides.jp/routing.html][Rails のルーティング - Railsガイド]]
** TODO [[https://d4192.hatenablog.com/entry/2019/04/10/190800][Railsルーティングのあれこれ(routes.rb) - プログラミングのメモ帳]]
** TODO [[https://techracho.bpsinc.jp/baba/2020_11_20/15619][Railsのルーティングを極める (後編)｜TechRacho by BPS株式会社]]
** TODO [[https://qiita.com/ryo88c/items/0a3c7861015861026e00][「WebAPI 設計のベストプラクティス」に対する所感 - Qiita]]
* Reference
* Archives
