public/20211217165855-web_api.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2022-05-29 -->
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title>Web API</title>
<meta name="generator" content="Org mode">
<meta name="author" content="root">
<link rel='stylesheet' href='https://cdn.jsdelivr.net/npm/bootstrap@5.0.2/dist/css/bootstrap.min.css' /><link rel="preconnect" href="https://fonts.googleapis.com"><link rel="preconnect" href="https://fonts.gstatic.com" crossorigin><link href="https://fonts.googleapis.com/css2?family=Ultra&display=swap" rel="stylesheet"><link rel='stylesheet' href='css/site.css' /><link rel='stylesheet' href='css/code.css' />
</head>
<body>
<div id="preamble" class="status">
<div><div class="header"><div class="container"><div class="row"><div class="col-sm-12 col-md-12"><nav class="navbar navbar-light"/></div></div></div></div></div>
</div>
<div id="content">
<h1 class="title">Web API</h1>
<div id="outline-container-org556903f" class="outline-2">
<h2 id="org556903f"><a href="#org556903f">概要</a></h2>
<div class="outline-text-2" id="text-org556903f">
<p>
幅広いAPIという概念のなかで、とくにWebのこと、Web APIについてまとめる。
<a href="20210509095946-rails.html#ID-e04aa1a3-509c-45b2-ac64-53d69c961214">Rails</a>などWEBアプリケーションを開発する場合、必ず使う。
</p>
</div>
</div>
<div id="outline-container-org73b2654" class="outline-2">
<h2 id="org73b2654"><a href="#org73b2654">Memo</a></h2>
<div class="outline-text-2" id="text-org73b2654">
</div>
<div id="outline-container-orga80d932" class="outline-3">
<h3 id="orga80d932"><a href="#orga80d932">Swagger</a></h3>
<div class="outline-text-3" id="text-orga80d932">
<p>
SwaggerはAPIドキュメントツールである。ymlやjsonを記述して、ブラウザで閲覧できる。
<a href="20210509095946-rails.html#ID-e04aa1a3-509c-45b2-ac64-53d69c961214">Rails</a>でのラッパーライブラリはrswagで、自然に扱うことができる。
</p>

<ul class="org-ul">
<li>リポジトリ
<a href="https://github.com/rswag/rswag">rswag/rswag: Seamlessly adds a Swagger to Rails-based API&rsquo;s</a></li>
<li>コードの例
<a href="https://github.com/ruslantolstov/rswag-example">ruslantolstov/rswag-example: Demo how to use rswag-api, rswag-specs.</a></li>
<li>記法例
<a href="https://techblog.zozo.com/entry/swagger_yaml">開発効率を上げる！Swaggerの記法まとめ - ZOZO TECH BLOG</a></li>
</ul>

<p>
まとまっているサイト。<a href="https://qiita.com/disc99/items/37228f5d687ad2969aa2">SwaggerでRESTful APIの管理を楽にする - Qiita</a>
</p>
</div>
</div>
</div>

<div id="outline-container-org0108885" class="outline-2">
<h2 id="org0108885"><a href="#org0108885">Tasks</a></h2>
<div class="outline-text-2" id="text-org0108885">
</div>
<div id="outline-container-orge349125" class="outline-3">
<h3 id="orge349125"><a href="#orge349125"><span class="todo TODO">TODO</span> API周りのソースコードを見る</a></h3>
<div class="outline-text-3" id="text-orge349125">
<ul class="org-ul">
<li>だいたいの型</li>
<li>実装の流れ</li>
</ul>
</div>
</div>
<div id="outline-container-orge630f0f" class="outline-3">
<h3 id="orge630f0f"><a href="#orge630f0f"><span class="todo TODO">TODO</span> <a href="https://www.amazon.co.jp/Web-API-Parts-%E6%B0%B4%E9%87%8E-%E8%B2%B4%E6%98%8E/dp/4873116864/ref=sr_1_2?__mk_ja_JP=%E3%82%AB%E3%82%BF%E3%82%AB%E3%83%8A&amp;crid=176CX1TFR474&amp;keywords=web+api&amp;qid=1640733660&amp;sprefix=web%2Caps%2C1017&amp;sr=8-2">Web API: The Good Parts | 水野 貴明 |本 | 通販 | Amazon</a></a></h3>
</div>
<div id="outline-container-orgc1a7a60" class="outline-3">
<h3 id="orgc1a7a60"><a href="#orgc1a7a60"><span class="todo TODO">TODO</span> <a href="https://railsguides.jp/routing.html">Rails のルーティング - Railsガイド</a></a></h3>
</div>
<div id="outline-container-org4a8f69e" class="outline-3">
<h3 id="org4a8f69e"><a href="#org4a8f69e"><span class="todo TODO">TODO</span> <a href="https://d4192.hatenablog.com/entry/2019/04/10/190800">Railsルーティングのあれこれ(routes.rb) - プログラミングのメモ帳</a></a></h3>
</div>
<div id="outline-container-orgfbf22d7" class="outline-3">
<h3 id="orgfbf22d7"><a href="#orgfbf22d7"><span class="todo TODO">TODO</span> <a href="https://techracho.bpsinc.jp/baba/2020_11_20/15619">Railsのルーティングを極める (後編)｜TechRacho by BPS株式会社</a></a></h3>
</div>
<div id="outline-container-org1c20bbd" class="outline-3">
<h3 id="org1c20bbd"><a href="#org1c20bbd"><span class="todo TODO">TODO</span> <a href="https://qiita.com/ryo88c/items/0a3c7861015861026e00">「WebAPI 設計のベストプラクティス」に対する所感 - Qiita</a></a></h3>
</div>
</div>
<div id="outline-container-orga886570" class="outline-2">
<h2 id="orga886570"><a href="#orga886570">Reference</a></h2>
</div>
<div id="outline-container-orgb1bf82c" class="outline-2">
<h2 id="orgb1bf82c"><a href="#orgb1bf82c">Archives</a></h2>
</div>
</div>
<div id="postamble" class="status">
<footer class="footer py-3"><div class="container"><div class="row "><div class="col-md-4"></div><div class="col-sm col-md"><nav class="navbar"><a class="nav-link text-secondary small px-0" href="./index.html">Insomnia</a><a class="nav-link text-secondary small px-0" href="./sitemap.html">Sitemap</a><a class="nav-link text-secondary small px-0" href="https://github.com/kijimaD/roam">Repository</a><a class="nav-link text-secondary small px-0" href="https://github.com/kijimaD">@kijimaD</a></nav></div><div class="col-md-4"></div></div></div></footer><script src="https://cdn.jsdelivr.net/npm/bootstrap@5.0.2/dist/js/bootstrap.bundle.min.js"/>
</div>
</body>
</html>
